<!--主体组件-->
<template>
  <div id="fiction_chapter_content" class="read-content" :style="{'font-size':$store.getters.getFontSize+'px'}">
    <h4>福尔摩斯</h4>
    <p>
      福尔摩斯一声不响地坐了好几个钟头了。他弯着瘦长的身子，埋头盯住他面前的一只化学试管，试管里正煮着一种特别恶臭的化合物。他脑袋垂在胸前的样子，从我这里望去，就象一只瘦长的怪鸟，全身披着深灰的羽毛，头上的冠毛却是黑的。
      他忽然说：“华生，原来你不打算在南非投资了，是不是？”
      我吃了一惊。虽然我已习惯了福尔摩斯的各种奇特本领，但他这样突然道破我的心事，仍令我无法解释。
      “你怎么会知道？"我问他。
      他在圆凳上转过身来，手里拿着那支冒气的试管。从他深陷的眼睛里，微微露出想笑出来的样子。
      “现在，华生，你承认你是吃惊了，"他说。
      “我是吃惊了。”
      “我应该叫你把这句话写下来，签上你的名字。”
    </p>
    <p>
      福尔摩斯一声不响地坐了好几个钟头了。他弯着瘦长的身子，埋头盯住他面前的一只化学试管，试管里正煮着一种特别恶臭的化合物。他脑袋垂在胸前的样子，从我这里望去，就象一只瘦长的怪鸟，全身披着深灰的羽毛，头上的冠毛却是黑的。
      他忽然说：“华生，原来你不打算在南非投资了，是不是？”
      我吃了一惊。虽然我已习惯了福尔摩斯的各种奇特本领，但他这样突然道破我的心事，仍令我无法解释。
      “你怎么会知道？"我问他。
      他在圆凳上转过身来，手里拿着那支冒气的试管。从他深陷的眼睛里，微微露出想笑出来的样子。
      “现在，华生，你承认你是吃惊了，"他说。
      “我是吃惊了。”
      “我应该叫你把这句话写下来，签上你的名字。”
    </p>
    <p>
      福尔摩斯一声不响地坐了好几个钟头了。他弯着瘦长的身子，埋头盯住他面前的一只化学试管，试管里正煮着一种特别恶臭的化合物。他脑袋垂在胸前的样子，从我这里望去，就象一只瘦长的怪鸟，全身披着深灰的羽毛，头上的冠毛却是黑的。
      他忽然说：“华生，原来你不打算在南非投资了，是不是？”
      我吃了一惊。虽然我已习惯了福尔摩斯的各种奇特本领，但他这样突然道破我的心事，仍令我无法解释。
      “你怎么会知道？"我问他。
      他在圆凳上转过身来，手里拿着那支冒气的试管。从他深陷的眼睛里，微微露出想笑出来的样子。
      “现在，华生，你承认你是吃惊了，"他说。
      “我是吃惊了。”
      “我应该叫你把这句话写下来，签上你的名字。”
    </p>
    <p>
      福尔摩斯一声不响地坐了好几个钟头了。他弯着瘦长的身子，埋头盯住他面前的一只化学试管，试管里正煮着一种特别恶臭的化合物。他脑袋垂在胸前的样子，从我这里望去，就象一只瘦长的怪鸟，全身披着深灰的羽毛，头上的冠毛却是黑的。
      他忽然说：“华生，原来你不打算在南非投资了，是不是？”
      我吃了一惊。虽然我已习惯了福尔摩斯的各种奇特本领，但他这样突然道破我的心事，仍令我无法解释。
      “你怎么会知道？"我问他。
      他在圆凳上转过身来，手里拿着那支冒气的试管。从他深陷的眼睛里，微微露出想笑出来的样子。
      “现在，华生，你承认你是吃惊了，"他说。
      “我是吃惊了。”
      “我应该叫你把这句话写下来，签上你的名字。”
    </p>
  </div>
</template>

<script>
export default{

}
</script>

<style>
  .read-content{
    padding: 1.5rem;
    font-size: 1.4rem;
    color:#555;
    line-height: 3rem;
  }
  .read-content h4{
    margin-bottom: 1rem;
    font-size: 2rem;
    color:  #736357;
    border-bottom: 1px solid #736357;
    letter-spacing: 1px;
  }
  .read-content p{
    text-indent:2.4rem;
    margin: 0.5rem 0;
    line-height: 3rem;
  }
</style>
